package homework.lesson9HW;

public class Task_19 {

    //Найдите логическую ошибку в программе и исправьте её:

    public static void main(String[] args) {
        for (int i = 0; i >= 10; i--) {
            System.out.println(i);
        }
    }
}
