package homework.lesson9HW;

public class Task_21 {

    //Найдите логическую ошибку в программе и исправить её:

    public static void main(String[] args) {
        for (int i = 0; i < 10; i++)
            System.out.println(i);
    }
}

