package homework.lesson12HW.arrays_while_loop;

// Найдите логическую ошибку в программе и исправить её.
//Программа должна выводить числа от 1 до 100 на консоль.
public class Task_5 {

    public static void main(String[] args) {
        int i = 1;
        while (i <= 100) {
            System.out.println(i);
            i++;
        }
    }

}
